///////////////////////////////////////////////////////////////////////////////
//                            ФУНКЦИИ ФИО                                    //
///////////////////////////////////////////////////////////////////////////////

//
function fio2dat(fio) {
    if (!!!fio) return ''
    return fio2fio2(fio).split(' ').map(w => fam2dat(w)).join(' ')
}

// перевод ФИО в дательный падеж (кому) ///////////////////////////////////////
function fam2dat(wrd) {
    let out = wrd

    if (wrd.slice(-2) == 'ин') out = wrd.slice(0, -2) + 'ину'
    if (wrd.slice(-2) == 'ва') out = wrd.slice(0, -2) + 'вой'
    if (wrd.slice(-2) == 'ев') out = wrd.slice(0, -2) + 'еву'

    return out
}

//=======================================================================================
// Иванов Петр Сидорович -> Иванов ПС
//=======================================================================================
function fio2fio0(fio) {
    if (!!!fio) return ''
    if (fio === null) return ''
    let arrayOffio = fio.split(' ');
    if (arrayOffio.length < 3) return fio
    return arrayOffio[0] + ' ' + arrayOffio[1].substring(0, 1) + arrayOffio[2].substring(0, 1);
}
//=======================================================================================
// Иванов Петр Сидорович -> Иванов П.С.
//=======================================================================================
function fio2fio(fio) {
    if (!!!fio) return ''
    let arrayOffio = fio.split(' ');
    return arrayOffio[0] + ' ' + arrayOffio[1].substring(0, 1) + '.' + arrayOffio[2].substring(0, 1) + '.';
}
//=======================================================================================
// Иванов Петр Сидорович -> Иванов П. С.
//=======================================================================================
function fio2fio1(fio) {
    if (!!!fio) return ''
    let arrayOffio = fio.split(' ');
    return arrayOffio[0] + ' ' + arrayOffio[1].substring(0, 1) + '. ' + arrayOffio[2].substring(0, 1);
}

///////////////////////////////////////////////////////////////////////////////////////////
// Иванов Петр Сидорович -> П.С. Иванов
///////////////////////////////////////////////////////////////////////////////////////////
function fio2fio2(fio) {
    if (!!!fio) return ''
    let arrayOffio = fio.split(' ');
    return arrayOffio[1].substring(0, 1) + '.' + arrayOffio[2].substring(0, 1) + '. ' + arrayOffio[0];
}

function txt2dat(txt) {
    return txt.split(' ').map(w => wrd2dat(w)).join(' ').toLowerCase()
}

function wrd2dat(wrd) {
    let out = wrd

    if (wrd == 'отдел') out = 'отдела'
    if (wrd == 'Отдел') out = 'отдела'
    if (wrd == 'начальник') out = 'Начальнику'
    if (wrd == 'Начальник') out = 'Начальнику'
    if (wrd.slice(-4) == 'ский') out = wrd.slice(0, -4) + 'ского'
    if (wrd.slice(-3) == 'вой') out = wrd.slice(0, -3) + 'вого'
    if (wrd.slice(-3) == 'вый') out = wrd.slice(0, -3) + 'вого'
    if (wrd.slice(-3) == 'ный') out = wrd.slice(0, -3) + 'ного'
    if (wrd.slice(-3) == 'щий') out = wrd.slice(0, -3) + 'щего'

    return out
}

//=======================================================================================
function txt2txt(text) {
    return text.toLowerCase()
        .replace('общий', 'общего')
        .replace('аналитический', 'аналитического')
        .replace('контрольный', 'контрольного')
        .replace('правовой', 'правового')
        .replace('финансовый', 'финансового')
        .replace('хозяйственный', 'хозяйственного')
        .replace('финансовый', 'финансового')
        .replace('руководство', 'УФНС России по Ростовской области')
        .replace('начальник отдела', 'Начальник')
        .replace('заместитель начальника отдела', 'И.о. начальника')
        .replace('отдел', 'отдела')
        .replace('руководитель управления', 'Руководитель')
        .replace('заместитель руководителя управления', 'И.о. руководителя');
}

//=======================================================================================
function txt4txt(text) {
    return text.toLowerCase()
        .replace('И.о. руководителя', 'заместитель руководителя управления')
        .replace('Руководитель', 'руководитель управления')
        .replace('И.о. начальника', 'заместитель начальника отдела')
        .replace('отдела', 'отдел')
        .replace('общего', 'общий')
        .replace('аналитического', 'аналитический')
        .replace('контрольного', 'контрольный')
        .replace('правового', 'правовой')
        .replace('финансового', 'финансовый')
        .replace('хозяйственного', 'хозяйственный')
        .replace('финансового', 'финансовый')
        .replace('УФНС России по Ростовской области', 'руководство')
        .replace('Начальник', 'начальник отдела')
}